# 자기소개 프로그램
# 이름, 나이, 성별, 키

'''
안녕하세요 제 이름은 ooo 입니다.
나이는 oo살이고 성별은 oo 입니다.
키는 ooo.ocm 입니다.
'''
이름 = '김가빈'       # 글자
나이 = 18             # 숫자
성별 = '여자'         # 글자
키 = 163.0            # 소수점 있는 숫자

print('안녕하세요 제 이름은',이름,'입니다.')
print('나이는' ,나이, '살이고 성별은',성별,'입니다.')
print('키는',키,'cm입니다.')



# 127-4   
print(127-4)        #123
print('127-4')      #127-4

# 자료형 : 개발자의 의도를 명확히 해주고 오류를 발견해줌
# '' : 문자열 str (글자)
# 314 : 정수 int (소수점없는숫자)
# 3.14 : 실수 float (소수점있는숫자)
print(int(3.14))
print(float(3))
print(str(314))